#include <bits/stdc++.h>

using namespace std;

int N, M;

short board[501][501];

pair<int, int> a[19][4] =
{
{{0,0}, {1,0}, {2,0}, {3,0}},//----
{{0,0}, {0,1}, {0,2}, {0,3}},//----회전
{{0,0}, {1,0}, {0,1}, {1,1}},//정사각
{{0,0}, {0,1}, {1,1}, {1,2}},//z
{{1,0}, {0,1}, {1,1}, {0,2}},//z대칭
{{0,1}, {1,1}, {1,0}, {2,0}},//z회전
{{0,0}, {1,0}, {1,1}, {2,1}},//z회전대칭
{{0,0}, {0,1}, {0,2}, {1,2}},
{{0,0}, {1,0}, {1,1}, {1,2}},
{{0,2}, {1,0}, {1,1}, {1,2}},
{{0,0}, {0,1}, {0,2}, {1,0}},//
{{0,0}, {1,0}, {2,0}, {0,1}},
{{0,0}, {1,0}, {2,0}, {2,1}},
{{0,1}, {1,1}, {2,1}, {0,0}},
{{0,1}, {1,1}, {2,1}, {2,0}},//
{{0,0}, {1,0}, {2,0}, {1,1}},
{{0,1}, {1,1}, {2,1}, {1,0}},
{{0,0}, {0,1}, {0,2}, {1,1}},
{{1,0}, {1,1}, {1,2}, {0,1}}
};

int main()
{
	ios::sync_with_stdio(false);
	cin.tie(nullptr);
	cout.tie(nullptr);

	cin >> N >> M;

	for (int i = 0; i < N; ++i)
	{
		for (int j = 0; j < M; ++j)
		{
			cin >> board[i][j];
		}
	}

	int ans = 0;
	//100만 * (19) = 1900만
	for (int i = 0; i < N; ++i)
	{
		for (int j = 0; j < M; ++j)
		{
			//5가지 도형 순회
			for (int k = 0; k < 19; ++k)
			{
				//4가지 숫자의 합 결정
				int temp = 0;
				bool canloop = true;
				for (int l = 0; l < 4; ++l)
				{
					int x = j + a[k][l].first;
					int y = i + a[k][l].second;

					//범위 넘어가면  for문 종료
					if (x < 0 || y < 0 || x >= M || y >= N)
					{
						canloop = false;
						break;
					}

					temp += board[y][x];
				}

				if (canloop)
				{
					ans = max(ans, temp);
				}
			}
		}
	}

	cout << ans;

	return 0;
}